app/Filters/AuthUserFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login')->with('msg', 'Debes iniciar sesion');
        }

        $userId = $session->get('id');
        $user = new User();
        $user = $user->find($userId);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '21'