app/Controllers/Cart.php

    public function view()
    {
        $cart = $this->cart->contents();
        $model = new Products();
        $productos = [];

        foreach ($cart as $item) {
            $producto = $model->find($item['id']);
---
SELECT *
FROM `product`
WHERE `product`.`id` = '10'