app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `email` = 'admin@test.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $model = new User();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password') ?? '';

        if (is_null($password)) {
            $session->setFlashdata('msg', $password);
            return redirect()->to(base_url('/login'));
        }

        $data = $model->where('email', $email)->first();