app/Controllers/Product.php

SELECT *
FROM `product`
ORDER BY `id` ASC
---
    public function index()
    {
        $product = new Products();
        //consulta a bd
        $datos['product'] = $product->orderBy('id', 'ASC')->findAll();

SELECT *
FROM `product`
WHERE `product`.`id` = '8'
UPDATE `product` SET `nombre` = 'Almendras', `descripcion` = '200gr', `id_categoria` = '1', `cantidad` = '100', `precio` = '1250.00', `activo` = 'SI', `imagen` = '1716413284_c9bed0a80e601146ec71.jpeg'
WHERE `product`.`id` IN ('8')
---
    public function save($id = null)
    {
        $product = new Products();

        $data = [
            'nombre' => $this->request->getPost('nombre'),
            'descripcion' => $this->request->getPost('descripcion'),
            'id_categoria' => $this->request->getPost('id_categoria'),
            'cantidad' => $this->request->getPost('cantidad'),
            'precio' => $this->request->getPost('precio'),
        ];

        //verificar existencia
        $imagen = $this->request->getFile('imagen');

        if ($imagen && $imagen->isValid() && !$imagen->hasMoved()) {
            $newNameImagen = $imagen->getRandomName();
            $imagen->store('../../assets/img', $newNameImagen);

            $data['imagen'] = $newNameImagen;
        } elseif ($id) {

            $productId = $product->find($id);
            $data['imagen'] = $productId['imagen'];
        }

        if ($id) {
            $productId = $product->find($id);
            if (!$productId) {
                return redirect()->to('/listar')->with('error', 'Producto no encontrado');
            }
            $product->update($id, $data);