app/Controllers/Users.php

    public function form($id = null)
    {
        $users = new User();
        $data['user'] = $id ? $users->find($id) : null;
---
SELECT *
FROM `user`
WHERE `user`.`id` = '23'