app/Controllers/Ventas.php

SELECT *
FROM `Ventas_cabecera`
ORDER BY `id_venta` ASC
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `Ventas_cabecera`
SELECT *
FROM `user`
WHERE `user`.`id` = '23'
---
    public function index($page = 1)
    {
        $ventas = new VentasCabecera();
        $perPage = 9;
        $datos['ventas'] = $ventas->orderBy('id_venta', 'ASC')->paginate($perPage, 'group1', $page);
        $datos['pager'] = $ventas->pager;
        $usuario = new User();
        $tipoPago = new TipoPago();

        foreach ($datos['ventas'] as &$venta) {
            $email = $usuario->find($venta['usuario_id']);

SELECT *
FROM `Ventas_cabecera`
WHERE `usuario_id` = '16'
ORDER BY `id_venta` ASC
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `Ventas_cabecera`
WHERE `usuario_id` = '16'
SELECT *
FROM `user`
WHERE `user`.`id` = '16'
---
    public function ventasUser($id, $page = 1)
    {
        $ventas = new VentasCabecera();
        $perPage = 9;
        $datos['ventas'] = $ventas->where('usuario_id', $id)->orderBy('id_venta', 'ASC')->paginate($perPage, 'group1', $page);
        $datos['pager'] = $ventas->pager;
        $usuario = new User();
        $tipoPago = new TipoPago();

        foreach ($datos['ventas'] as &$venta) {
            $email = $usuario->find($venta['usuario_id']);

SELECT *
FROM `Ventas_cabecera`
WHERE `Ventas_cabecera`.`id_venta` = '19'
SELECT *
FROM `Ventas_detalle`
WHERE `venta_id` = '19'
SELECT *
FROM `Envio_detalle`
WHERE `venta_id` = '19'
 LIMIT 1
---
    public function comprobante($id_venta)
    {
        $ventasCabecera = new VentasCabecera();
        $ventasDetalle = new VentasDetalle();
        $enviosDetalle = new EnvioDetalle();

        $ventas = $ventasCabecera->find($id_venta);
        $ventaDetalle = $ventasDetalle->where('venta_id', $id_venta)->findAll();
        $envio = $enviosDetalle->where('venta_id', $id_venta)->first();